In [1]:
# lets try to bring in the cvs file here

import pandas as pd

pd.read_csv("City Rating.csv")

,Unnamed: 0,city,temp10,temp11,temp12,new_temp,MelRating,IbrahimRating
0,0,Kuala Lumpur,30,23,25,31,1,5
1,1,Singapore,27,20,24,29,2,2
2,2,Jakarta,31,25,27,32,4,6
3,3,Delhi,23,19,21,35,5,5
4,4,Beijing,10,-2,5,5,3,4

In [3]:
df2 = pd.read_csv("City Rating without Row Numbers.csv")
df2

           city  temp10  temp11  temp12  new_temp  MelRating  IbrahimRating
0  Kuala Lumpur      30      23      25        31          1              5
1     Singapore      27      20      24        29          2              2
2       Jakarta      31      25      27        32          4              6
3         Delhi      23      19      21        35          5              5
4       Beijing      10      -2       5         5          3              4

In [5]:
import pandas as pd

df = pd.read_csv("grades.csv")
df

      Name  Adam  Wong  Ranjit  Rahim
0    Maths    65    90      70     80
1  English    86    85      75     85
2  Science    85    58      79     87